src/cf/InformationRegisters/МП_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МП_ТипыНастроекПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/МП_ТипыНастроекПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МП_ТипыНастроекПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьPushУведомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеФорматовПередаваемыхФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодПервичнойЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодробныйПротоколОбменаСМобильнымУстройством</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияКалендаря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияКонтроля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияМероприятий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияОтсутствий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияСамочувствий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияУчетаВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокУстареванияДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФорматыПередаваемыхФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРаботПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпособУказанияВремени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыОтсутствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыОтсутствий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВФондеРабочегоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУдаленнаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ГрафикУчетаСамочувствияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГрафикУчетаСамочувствияСотрудников</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействительная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/HTTPServices/MobileApp/Ext/Module.bsl
#Область ОбработкаHttpЗапроса
//Выполняет запись сообщений с мобильного (входящих), запускает фоновое задание по обработке входящих и 
//формированию исходящих сообщений. 
//Возвращает httpОтвет клиенту.
//Параметры:
//Запрос - httpЗапрос с мобильного клиента, в котором содержаться параметры для сборки ответного сообщения
Функция ExchangePUT(Запрос)
	
	Перем ОписаниеОшибкиВхода;
	
	УстановитьПривилегированныйРежим(Истина);

	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();

	Разрешен = МП_СлужебныйПовтИсп.ВходПользователюРазрешен(ОписаниеОшибкиВхода, ТекущийПользователь);

	Если Не Разрешен Тогда
		Возврат ОтветКлиентуОшибка(ОписаниеОшибкиВхода);
	КонецЕсли; 
		
	ПараметрыЗапроса = ПараметрыЗапроса(Запрос);
	
	МобильноеПриложение = МП_СлужебныйПовтИсп.МобильноеПриложение(ОписаниеОшибкиВхода, 
		ПараметрыЗапроса.Получить("ClientCode"), ТекущийПользователь);
	
	Если МобильноеПриложение = Неопределено Тогда
		Возврат ОтветКлиентуОшибка(ОписаниеОшибкиВхода);
	КонецЕсли; 
	
	СтруктурыВходящихСообщений = ПараметрыЗапроса.Получить("Messages");
	
	ФормироватьОтветноеСообщение = ПараметрыЗапроса.Получить("NeedNewData") <> Неопределено 
		И ПараметрыЗапроса.Получить("NeedNewData") = Истина;
	
	Попытка
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(МобильноеПриложение);
		МассивПараметров.Добавить(СтруктурыВходящихСообщений);
		МассивПараметров.Добавить(ФормироватьОтветноеСообщение);
		МП_Служебный.ЗапуститьФоновоеЗадание(МобильноеПриложение, МассивПараметров,
			"МП_Служебный.ВыполнитьСинхронизациюДанных");
	
	Исключение
		
		Возврат ОтветКлиентуОшибка(ОписаниеОшибки());
		
	КонецПопытки; 
	
	Возврат СобратьОтветКлиенту(МобильноеПриложение, ПараметрыИсходящегоСообщения(ПараметрыЗапроса), ,
		ФормироватьОтветноеСообщение);
	
КонецФункции

//Возвращает httpОтвет клиенту
//Параметры:
//Запрос - httpЗапрос с мобильного клиента, в котором содержаться параметры для сборки ответного сообщения
Функция ExchangeGET(Запрос)
	
	Перем ОписаниеОшибкиВхода;
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Разрешен = МП_СлужебныйПовтИсп.ВходПользователюРазрешен(ОписаниеОшибкиВхода, ТекущийПользователь);

	Если Не Разрешен Тогда
		Возврат ОтветКлиентуОшибка(ОписаниеОшибкиВхода);
	КонецЕсли; 
		
	ПараметрыЗапроса = ПараметрыЗапроса(Запрос);
	
	МобильноеПриложение = МП_СлужебныйПовтИсп.МобильноеПриложение(ОписаниеОшибкиВхода, 
		ПараметрыЗапроса.Получить("ClientCode"), ТекущийПользователь);
	
	Если МобильноеПриложение = Неопределено Тогда
		Возврат ОтветКлиентуОшибка(ОписаниеОшибкиВхода);
	КонецЕсли; 
	
	Возврат СобратьОтветКлиенту(МобильноеПриложение, ПараметрыИсходящегоСообщения(ПараметрыЗапроса));
	
КонецФункции

//Возвращает httpОтвет клиенту
//Параметры:
//Запрос - httpЗапрос с мобильного клиента, в котором содержаться параметры для сборки ответного сообщения
Функция GetDataGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗапроса = ПараметрыЗапроса(Запрос); 
	
	Если ТипЗнч(ПараметрыЗапроса) <> Тип("Соответствие") Тогда
		
		ВызватьИсключение ("Возможно версия клиента устарела.");
		
	КонецЕсли; 
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		
	ОписаниеОшибкиВхода = "";
	
	МобильноеПриложение = МП_СлужебныйПовтИсп.МобильноеПриложение(ОписаниеОшибкиВхода, 
		ПараметрыЗапроса.Получить("ClientCode"), ТекущийПользователь);
		
	Если МобильноеПриложение = Неопределено Тогда
		ВызватьИсключение(ОписаниеОшибкиВхода);
	КонецЕсли; 
	
	ПараметрыСинхронизации = МП_СлужебныйПовтИсп.ПараметрыСинхронизации(МобильноеПриложение);
	
	Ключ = ПараметрыЗапроса.Получить("Key");
	
	Если Ключ <> Неопределено Тогда
		
		Если Ключ = "ЗапросОбъекта" Тогда
			Данные = ВыгрузитьЗапрошенныйОбъект(ПараметрыЗапроса.Получить("ID"), 
				ПараметрыЗапроса.Получить("Type"), МобильноеПриложение);
		КонецЕсли; 

		Если Ключ = "ВидыОтсутствия" Тогда
			ИспользоватьОтсутствия = ПолучитьФункциональнуюОпцию("ИспользоватьОтсутствия");
			
			Если Не ИспользоватьОтсутствия Тогда
				ТекстПредупреждения = НСтр("ru = 'Отсутствия не используются'");
				ВызватьИсключение ТекстПредупреждения;
			КонецЕсли;
			
			Если Не ПараметрыСинхронизации.СинхронизацияОтсутствий Тогда
				ТекстПредупреждения = НСтр("ru = 'Не включен раздел синхронизации ""Мои Отсутствия"" '");
				ВызватьИсключение ТекстПредупреждения;
			КонецЕсли;
			
			Данные = ВидыОтсутствий();
			
		КонецЕсли;
		
		Если Ключ = "НастройкиВложений" Тогда
			
			Данные = НастройкиВложений();
			
		КонецЕсли;
		
		Если Ключ = "ВремяЗамеров" Тогда
			
			ИспользоватьСамочувствия = ПолучитьФункциональнуюОпцию("УчетСамочувствияСотрудников");
			
			Если Не ИспользоватьСамочувствия Тогда
				ТекстПредупреждения = НСтр("ru = 'Самочувствия не используются'");
				ВызватьИсключение ТекстПредупреждения;
			КонецЕсли;
			
			Если Не ПараметрыСинхронизации.СинхронизацияСамочувствий Тогда
				ТекстПредупреждения = НСтр("ru = 'Не включен раздел синхронизации ""Мое самочувствие"" '");
				ВызватьИсключение ТекстПредупреждения;
			КонецЕсли;

			
			Данные = ВремяЗамеров();
			
		КонецЕсли;
		
		Если Ключ = "ДоступностьМобильногоСканера" Тогда
			
			Данные = "МобильныйСканерДоступен";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Заголовки = ЗаголовкиОтветаДляПередачиЗапрошенногоОбъекта(Данные);
	
	Возврат СформироватьHttpОтвет(Заголовки, Данные);
	
КонецФункции

Функция PingPing(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтрокаОтвета = "Connection established successfully";
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета, КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции

// Возвращает httpОтвет клиенту
//
// Параметры:
//  Запрос - httpЗапрос с мобильного клиента, в котором содержаться параметры для сборки ответного сообщения
//
// Возвращаемое значение:
//   HTTPСервисОтвет
//
Функция PutDataPUT(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗапроса = ПараметрыЗапроса(Запрос); 
	
	Если ТипЗнч(ПараметрыЗапроса) <> Тип("Соответствие") Тогда
		
		ВызватьИсключение (НСтр("ru = 'Возможно версия клиента устарела.'"));
		
	КонецЕсли; 
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
		
	ОписаниеОшибкиВхода = "";
	
	МобильноеПриложение = МП_СлужебныйПовтИсп.МобильноеПриложение(ОписаниеОшибкиВхода, 
		ПараметрыЗапроса["ClientCode"], ТекущийПользователь);
	
	Если МобильноеПриложение = Неопределено Тогда
		ВызватьИсключение(ОписаниеОшибкиВхода);
	КонецЕсли;
	
	Ключ = ПараметрыЗапроса["Key"];
	
	Если Ключ <> Неопределено Тогда
		
		Если Ключ = "Скан" Тогда
			Данные = МК_ВызовСервера.ЗагрузитьСканы(Запрос.ПолучитьТелоКакДвоичныеДанные());
		КонецЕсли;
		
	КонецЕсли;
		
	Заголовки = ЗаголовкиОтветаДляПередачиЗапрошенногоОбъекта(Данные);
	
	Возврат СформироватьHttpОтвет(Заголовки, Данные);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыЗапроса(Запрос)
	
	Если Запрос.ПараметрыЗапроса.Количество() = 0 Тогда
		
		//Параметры запроса находятся в теле в виде соответствия
		СтрокаЗапросаТело = Запрос.ПолучитьТелоКакСтроку();
		
		ЧтениеJS = Новый ЧтениеJSON;
		
		ЧтениеJS.УстановитьСтроку(СтрокаЗапросаТело);
		
		JSЗапросХЗ = СериализаторXDTO.ПрочитатьJSON(ЧтениеJS);
		
		Если ТипЗнч(JSЗапросХЗ) <> Тип("ХранилищеЗначения")  Тогда
			
			ВызватьИсключение
				НСтр("ru='Тип запроса с мобильного не определен или старая версия мобильного приложения'");
		КонецЕсли; 
		
		ПараметрыЗапроса = JSЗапросХЗ.Получить();
		
		Если ПараметрыЗапроса = Неопределено Тогда
			
			ВызватьИсключение 
				НСтр("ru='Тип запроса с мобильного не определен или старая версия мобильного приложения'");
			
		КонецЕсли; 
		
	Иначе
		
		ПараметрыЗапроса = Новый Соответствие(Запрос.ПараметрыЗапроса);
		
	КонецЕсли; 
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ПараметрыИсходящегоСообщения(ПараметрыЗапроса)
	
	Возврат Новый Структура("ИдентификаторСообщения, НомерЧасти", 
		ПараметрыЗапроса.Получить("LastResponseID"), 
		Число(ПараметрыЗапроса.Получить("LastResponsePartIndex")));
	
КонецФункции

Функция ИсходящееСообщениеДляДоставки(МобильноеПриложение, ПараметрыИсходящегоСообщения = Неопределено) 
	
	
	
КонецФункции

Функция ЗаголовкиОтветаДляПередачиЧасти(ИдентификаторСообщения = "", НомерЧасти = 0, 
	ВсегоЧастей = 0)
	
	Заголовки = Новый Соответствие; 
	
	Осталось = ВсегоЧастей - НомерЧасти;
	Заголовки.Вставить("ResponseID",  ИдентификаторСообщения);
	Заголовки.Вставить("PartIndex", НомерЧасти);
	Заголовки.Вставить("TotalParts", ВсегоЧастей);
	Заголовки.Вставить("PartCount", Осталось);
	
	//Тип даных ответа - двоичные данные
	Заголовки.Вставить("Content-Type", "Application/octet-stream");
	
	Возврат Заголовки;
	
КонецФункции

Функция ЗаголовкиОтветаДляПередачиЗапрошенногоОбъекта(Данные)
	
	Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		
		Заголовки = Новый Соответствие();
		Заголовки.Вставить("Content-Type", "Application/octet-stream");
		Возврат Заголовки;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОтветКлиенту

Функция СобратьОтветКлиенту(МобильноеПриложение, ПараметрыИсходящегоСообщения = Неопределено,
	АктивныхФоновыхЗаданийНет = Ложь, ИскатьНеотправленныеСообщения = Истина)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИскатьНеотправленныеСообщения Тогда
		//Ищем сообщение по идентификатору. Если идентификатор пустой - функция вернет первое попавшее 
		//	готовое сообщение.
		ИсходящееСообщениеИС = ИсходящееСообщениеДляДоставки(МобильноеПриложение, 
			ПараметрыИсходящегоСообщения);
	
		Если ИсходящееСообщениеИС <> Неопределено Тогда
			
			НомерЧасти = 0;
			
			ИдентификаторСообщения = "";
			
			Если ПараметрыИсходящегоСообщения <> Неопределено Тогда 
				ПараметрыИсходящегоСообщения.Свойство("НомерЧасти", НомерЧасти);
				ПараметрыИсходящегоСообщения.Свойство("ИдентификаторСообщения", ИдентификаторСообщения);
			КонецЕсли; 
			
			ЧастиСообщения = МП_СлужебныйПовтИсп.ДанныеСообщения(ИсходящееСообщениеИС);
			
			Если ТипЗнч(ЧастиСообщения) = Тип("Массив") Тогда
				КоличествоЧастей = ЧастиСообщения.Количество();
			Иначе
				КоличествоЧастей = 0;
			КонецЕсли; 
			
			Если НомерЧасти = КоличествоЧастей Тогда
				
				//Помечаем сообщение обработанным и устанавливаем пометку удаления:
				МП_Служебный.ПометитьСообщениеОбработанным(ИсходящееСообщениеИС);
				
				//Формируем пустые заголовки для клиента
				Заголовки = ЗаголовкиОтветаДляПередачиЧасти();
				
				//На клиент возвращаем ответ об обнуление идентификатора и номера принятой части.
				Возврат ОтветКлиентуЧасть(Заголовки);
				
			Иначе
				
				Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
					ИдентификаторСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходящееСообщениеИС,
						"ИдентификаторСообщения");
				КонецЕсли; 
				
				НомерСледующейЧасти = НомерЧасти + 1;
				
				Заголовки = ЗаголовкиОтветаДляПередачиЧасти(ИдентификаторСообщения, НомерСледующейЧасти, 
					КоличествоЧастей);
				
				//Получаем часть по индексу
				Возврат ОтветКлиентуЧасть(Заголовки, ЧастиСообщения[НомерСледующейЧасти - 1]);
				
			КонецЕсли;

		КонецЕсли;
			
	КонецЕсли;
	
	Если АктивныхФоновыхЗаданийНет Тогда
		// исходящего сообщения нет, активных фоновых заданий нет - возвращаем ответ клиенту ОК.
		Возврат ОтветКлиентуОк();
		
	КонецЕсли;
	
	//Проверим нет ли активных заданий:
	АктивныеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(
		Новый Структура("Наименование, Состояние", МобильноеПриложение.Код,
		СостояниеФоновогоЗадания.Активно));
	
	АктивныхФоновыхЗаданийНет = АктивныеФоновыеЗадания.Количество() = 0;
	
	Если АктивныхФоновыхЗаданийНет Тогда
		//Вызовем эту же функцию, и если завершились фоновые задания передаем признак их завершения 
		Возврат СобратьОтветКлиенту(МобильноеПриложение, , АктивныхФоновыхЗаданийНет,
			ИскатьНеотправленныеСообщения);
		
	Иначе
		//Для уменьшения количества обращений с клиента:
		Возврат ОтветКлиентуЖдите();
		
	КонецЕсли;
		
КонецФункции

Функция ОтветКлиентуОк()

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("OK");
	
	Возврат СформироватьHttpОтвет(Заголовки);

КонецФункции

Функция ОтветКлиентуОшибка(ОписаниеОшибки)
	
	Заголовки = Новый Соответствие;
	
	Заголовки.Вставить("Error");
		
	Возврат СформироватьHttpОтвет(Заголовки, ОписаниеОшибки);

КонецФункции

Функция ОтветКлиентуЖдите()
	
	Возврат СформироватьHttpОтвет();
	
КонецФункции

Функция ОтветКлиентуЧасть(Заголовки, Часть = Неопределено)
	
	Возврат СформироватьHttpОтвет(Заголовки, Часть);
	
КонецФункции

Функция СформироватьHttpОтвет(Заголовки = Неопределено, Данные = Неопределено)
	
	Если Заголовки <> Неопределено Тогда
		Ответ = Новый HTTPСервисОтвет(200, , Заголовки);
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
	КонецЕсли; 
	
	Если Данные <> Неопределено Тогда
		
		Если ТипЗнч(Данные) = Тип("Строка") Тогда
			Ответ.УстановитьТелоИзСтроки(Данные, КодировкаТекста.UTF8);
		Иначе
			Ответ.УстановитьТелоИзДвоичныхДанных(Данные);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область ОбработкаЗапросаДанныхПоКлючу

Функция ВыгрузитьЗапрошенныйОбъект(ID, Тип, МобильноеПриложение)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСинхронизации = МП_СлужебныйПовтИсп.ПараметрыСинхронизации(МобильноеПриложение);
	
	Попытка
		
		ТипОбъекта = МП_СлужебныйПовтИсп.ТипСсылкиПоТипуМобильного(Тип);
		
		СсылкаНаОбъект = XMLЗначение(ТипОбъекта, ID);
		
		Если СсылкаНаОбъект.ПолучитьОбъект() = Неопределено Тогда
			ТипОбъекта = Тип("УдалениеОбъекта");
		КонецЕсли; 
		
		Если ТипОбъекта = Тип("СправочникСсылка.Файлы") Тогда
			
			ДанныеОбъекта = РаботаСФайламиВызовСервера.ПолучитьДвоичныеДанныеФайла(СсылкаНаОбъект);
			
		Иначе
			
			ТаблицаИзменений = Новый ТаблицаЗначений;
			
			ТаблицаИзменений.Колонки.Добавить("Ссылка", Новый ОписаниеТипов(
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипОбъекта)));
			
			ТаблицаИзменений.Колонки.Добавить("ПометкаУдаления", Новый ОписаниеТипов(
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("Булево"))));
			
			Строка = ТаблицаИзменений.Добавить();
			
			Строка.Ссылка = СсылкаНаОбъект;
			
			Строка.ПометкаУдаления = СсылкаНаОбъект.ПометкаУдаления;
			
			СтруктураРезультатов = Новый Структура;
			
			МП_Изменения.ИзмененияВсеОстальноеПоТаблицамЗаголовков(Тип, ТаблицаИзменений, 
				СтруктураРезультатов, ПараметрыСинхронизации);
			
			СтруктураСериализованныхДанных = МП_ФормированиеИсходящегоСообщения.ВыгружаемыеДанныеВJS(
				СтруктураРезультатов);
			
			ДанныеОбъекта = СтруктураСериализованныхДанных.ТекстJSON;
			
		КонецЕсли;
		
		Возврат ДанныеОбъекта;
		
	Исключение
		
		МП_ФормированиеИсходящегоСообщения.ПоместитьВОчередьСообщениеОбОшибке(МобильноеПриложение, 
			ИнформацияОбОшибке());
		
	КонецПопытки;
	
	
КонецФункции

Функция ВидыОтсутствий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОтсутствий.Ссылка КАК Ссылка,
		|	ВидыОтсутствий.ПометкаУдаления КАК ПометкаУдаления,
		|	ВидыОтсутствий.Наименование КАК Наименование,
		|	ВидыОтсутствий.Комментарий КАК Комментарий,
		|	ВидыОтсутствий.ЭтоУдаленнаяРабота КАК ЭтоУдаленнаяРабота
		|ИЗ
		|	Справочник.ВидыОтсутствий КАК ВидыОтсутствий
		|ГДЕ
		|	НЕ ВидыОтсутствий.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураРезультатов = Новый Структура;
	
	СтруктураРезультатов.Вставить(МП_СлужебныйПовтИсп.ТипВидОтсутствия(), РезультатЗапроса.Выгрузить());
	
	СтруктураСериализованныхДанных = МП_ФормированиеИсходящегоСообщения.ВыгружаемыеДанныеВJS(
		СтруктураРезультатов);
		
	ДанныеОбъекта = СтруктураСериализованныхДанных.ТекстJSON;
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция НастройкиВложений()
	
	//Настройки для вложения:
	Запрос = Новый Запрос;
	
	Запрос.Текст = МП_ПервоеПодключение.ТекстЗапросаМаксРазмерВложения();
	
	Результат = Запрос.Выполнить();
	
	ТипНастройкиСинхронизации = МП_СлужебныйПовтИсп.ТипНастройкиСинхронизации();
	
	СтруктураРезультатов = Новый Структура;
	
	МП_Изменения.ИнициализироватьТаблицуПоТипу(
		СтруктураРезультатов, ТипНастройкиСинхронизации);
	
	СтрокаНастроек = СтруктураРезультатов[ТипНастройкиСинхронизации].Добавить();
	
	СтрокаНастроек.ВидНастройки = "МаксимальныйРазмерВложения";
	СтрокаНастроек.Значение = Результат.Выгрузить()[0].Значение;
	СтрокаНастроек.НастройкаСтрокой = Истина;
	
	ОграничиватьФорматПередаваемыхДанных = РегистрыСведений.МП_НастройкиПользователей.ПолучитьНастройку(
		Пользователи.ТекущийПользователь(), Перечисления.МП_ТипыНастроекПользователей.ОграничениеФорматовПередаваемыхФайлов);
		
	Если ОграничиватьФорматПередаваемыхДанных = Истина Тогда
		СтрокаНастроек = СтруктураРезультатов[ТипНастройкиСинхронизации].Добавить();
		
		СтрокаНастроек.ВидНастройки = "ФорматыПередаваемыхФайлов";
		ФорматыПередаваемыхФайлов = РегистрыСведений.МП_НастройкиПользователей.ПолучитьНастройку(
			Пользователи.ТекущийПользователь(), Перечисления.МП_ТипыНастроекПользователей.ФорматыПередаваемыхФайлов);
	
		СтрокаНастроек.Значение = ФорматыПередаваемыхФайлов;
		СтрокаНастроек.НастройкаСтрокой = Истина;
	КонецЕсли;
	
	СтруктураСериализованныхДанных = МП_ФормированиеИсходящегоСообщения.ВыгружаемыеДанныеВJS(
		СтруктураРезультатов);
		
	ДанныеОбъекта = СтруктураСериализованныхДанных.ТекстJSON;
	
	Возврат ДанныеОбъекта;
	

КонецФункции

Функция ВремяЗамеров()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикУчетаСамочувствияСотрудников.Ссылка КАК Ссылка,
		|	ГрафикУчетаСамочувствияСотрудников.ПометкаУдаления КАК ПометкаУдаления,
		|	ГрафикУчетаСамочувствияСотрудников.ВремяЗамера КАК ВремяЗамера,
		|	ГрафикУчетаСамочувствияСотрудников.Недействительная КАК Недействительная
		|ИЗ
		|	Справочник.ГрафикУчетаСамочувствияСотрудников КАК ГрафикУчетаСамочувствияСотрудников
		|ГДЕ
		|	НЕ ГрафикУчетаСамочувствияСотрудников.ПометкаУдаления
		|	И НЕ ГрафикУчетаСамочувствияСотрудников.Недействительная";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураРезультатов = Новый Структура;
	
	СтруктураРезультатов.Вставить(МП_СлужебныйПовтИсп.ТипВремяЗамера(), РезультатЗапроса.Выгрузить());
	
	СтруктураСериализованныхДанных = МП_ФормированиеИсходящегоСообщения.ВыгружаемыеДанныеВJS(
		СтруктураРезультатов);
		
	ДанныеОбъекта = СтруктураСериализованныхДанных.ТекстJSON;
	
	Возврат ДанныеОбъекта;

КонецФункции

#КонецОбласти
